def hide_secret_data():
    """
    Прячет слова в тексте по критерию, заменяя их тем же
    количеством звездочек, что и в слове. Слово определяется
    функцией key, которая проверяет слово, если результат True -
    слово заменяется. Если key не передан - заменяются все слова:

    >>> hide_secret_data("а роза упала на лапу Азора")
    '* **** ***** ** **** *****'
    >>> hide_secret_data("а роза упала на лапу Азора", key=lambda word: word.istitle())
    'а роза упала на лапу *****'
    >>> hide_secret_data("а роза упала на лапу Азора", key=lambda word: len(word) > 2)
    'а **** ***** на **** *****'
    """
