# Сводка продаж и самая популярная книга.
# Дан список продаж `sales` типа `(книга, магазин, количество)`.
# Найдите множество книг, которые продавались абсолютно в каждом магазине (если такие есть).
# Найдите наиболее продаваемые книги по количеству, отсортировав их по названию.

if not globals().get("testing"):  # Проверка на случай тестов
    sales = [
        ("Мастер и Маргарита", "Буква", 12),
        ("1984", "Буква", 8),
        ("Дюна", "Буква", 5),
        ("Мастер и Маргарита", "Читай-город", 7),
        ("1984", "Читай-город", 11),
        ("Гарри Поттер", "Читай-город", 9),
        ("Мастер и Маргарита", "Книжный мир", 6),
        ("1984", "Книжный мир", 4),
        ("Дюна", "Книжный мир", 15),
    ]

common_books = set()  # Сохраните результат
bestsellers = []  # в эти переменные
