# Кассовый аппарат
# В начале дня касса пуста.
# Дан список платежей `transactions` вида `(цена, внесённая_сумма)`.
# Покупатель всегда вносит одну купюру, а касса выдаёт сдачу купюрами номиналом 1, 5, 10, 50 и 100, выбирая сначала самые крупные.
# Если выдать точную сдачу невозможно, покупка отменяется и купюра покупателя в кассе не остаётся.
# Сохраните сумму успешно совершённых покупок и итоговое количество купюр каждого номинала.

if not globals().get("testing"):  # Проверка на случай тестов
    transactions = [
        (1, 1),
        (1, 1),
        (1, 1),
        (1, 1),
        (1, 1),
        (5, 5),
        (10, 10),
        (50, 50),
        (94, 100),
        (39, 50),
        (47, 50),
        (95, 100),
    ]

successful_sum = 0  # Сохраните результат
cashbox = {}  # в эти переменные
