# Пропускной пункт.
# Проанализируйте список отметок пропусков на пропускном пункте `checks` типа `(имя, час отметки)`.
# Первая отметка - содрудник вошел в здание, вторая - вышел, третья - опять зашел и т.д.
# Постройте словарь из сотрудников, уже ушедших с работы, и продолжительности их работы.
# Составьте множество имен сотрудников, которые все еще на работе.

if not globals().get("testing"):  # Проверка на случай тестов
    checks = [
        ("Анна", 8),
        ("Борис", 9),
        ("Анна", 12),
        ("Анна", 13),
        ("Виктор", 10),
        ("Борис", 18),
        ("Анна", 17),
    ]

employees_working_hours = {}  # Сохраните результат
employees_still_working = set()  # в эти переменные
