# Рекомендации курсов.
# Даны словарь завершённых курсов студентов, словарь требуемых курсами навыков и словарь полученных навыков за каждый курс.
# Для каждого студента предложите не пройденные ими курсы.
# Студент должен уже обладать не менее 75% навыков, требуемых курсом.
# Курсы, где менее 3 требуемых навыков, рекомендуются автоматически.

students_courses = {
    "Анна": {"Основы Python", "Git"},
    "Борис": {"Основы Python", "SQL"},
    "Виктор": {"Git"},
}
course_requirements = {
    "Основы Python": {"алгоритмы"},
    "Git": {"командная строка", "файлы"},
    "SQL": {"таблицы", "фильтрация", "сортировка", "агрегация"},
    "Django": {"Python", "ООП", "HTTP", "базы данных"},
    "Docker": {"командная строка", "Linux", "сети", "файлы"},
}
course_achievements = {
    "Основы Python": {"Python", "алгоритмы", "ООП"},
    "Git": {"командная строка", "файлы"},
    "SQL": {"таблицы", "фильтрация", "сортировка", "агрегация", "базы данных"},
    "Django": {"веб-разработка"},
    "Docker": {"контейнеры", "Linux"},
}

recommendations = {}  # Сохраните результат сюда

# Ваше решение тут
