# Рекомендации по покупкам.
# Дан список покупок `sales` типа `(пользователь, товар)`.
# Составьте словарь с рекомендациями новых товаров для каждого пользователя.
# Если у двух пользователей хотя бы 3 общие покупки - порекомендуйте друг другу оставшиеся товары каждого.

if not globals().get("testing"):  # Проверка на случай тестов
    sales = [
        ("Анна", "кофе"),
        ("Анна", "чай"),
        ("Анна", "молоко"),
        ("Анна", "печенье"),
        ("Борис", "кофе"),
        ("Борис", "чай"),
        ("Борис", "молоко"),
        ("Борис", "шоколад"),
        ("Виктор", "кофе"),
        ("Виктор", "чай"),
        ("Виктор", "хлеб"),
        ("Галина", "кофе"),
        ("Галина", "шоколад"),
        ("Галина", "молоко"),
        ("Галина", "рис"),
    ]

recommendations = {}  # Сохраните результат сюда
