# Посещаемость и табель успеваемости.
# Дан список с информацией о студентах `students_info` типа `(имя, курс, успеваемость)`.
# Найдите предметы, которые изучали абсолютно все студенты (если такие есть).
# Выведите имена студентов с успеваемостью выше среднего в алфавитном порядке.

if not globals().get("testing"):  # Проверка на случай тестов
    students_info = [
        ("Анна", "Python", 9.5),
        ("Анна", "Git", 8.5),
        ("Анна", "SQL", 9.0),
        ("Борис", "Python", 7.0),
        ("Борис", "Git", 6.5),
        ("Борис", "Linux", 7.5),
        ("Виктор", "Python", 8.0),
        ("Виктор", "Git", 9.0),
        ("Виктор", "Docker", 8.5),
        ("Галина", "Python", 6.0),
        ("Галина", "Git", 7.0),
        ("Галина", "HTML", 6.5),
    ]

common_courses = set()  # Сохраните результат
students_above_average = []  # в эти переменные
