# Турнирная таблица.
# Дан список результатов матчей `games` типа `(домашняя_команда, гостевая_команда, голы_домашние, голы_гостевые)`.
# Посчитайте очки команд: 3 за победу, 1 за ничью, 0 за поражение.
# Определите чемпиона.

if not globals().get("testing"):  # Проверка на случай тестов
    games = [
        ("Сокол", "Вымпел", 2, 1),
        ("Метеор", "Рубин", 0, 0),
        ("Сокол", "Метеор", 1, 1),
        ("Вымпел", "Рубин", 3, 0),
        ("Рубин", "Сокол", 2, 3),
        ("Метеор", "Вымпел", 2, 0),
    ]

champion = ""  # Сохраните результат сюда
scores = {}
